## Plan output

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.system.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sqs-senzing/development"
      + name_prefix    = (known after apply)
      + region         = "us-west-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.system.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Encryption key for sqs-senzing development"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::207495628382:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "us-west-1"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "application" = "sqs-senzing-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sqs-senzing"
        }
    }

  # module.system.module.s3.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.system.module.s3.data.aws_iam_policy_document.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "default" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DefaultS3BucketPolicyStatement"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::207495628382:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system.module.s3.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "sqs-senzing-development-exports"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-west-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "application" = "sqs-senzing-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sqs-senzing"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.system.module.s3.aws_s3_bucket_lifecycle_configuration.main[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-west-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "exports"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # module.system.module.s3.aws_s3_bucket_ownership_controls.main will be created
  + resource "aws_s3_bucket_ownership_controls" "main" {
      + bucket = "sqs-senzing-development-exports"
      + id     = (known after apply)
      + region = "us-west-1"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.system.module.s3.aws_s3_bucket_policy.main will be created
  + resource "aws_s3_bucket_policy" "main" {
      + bucket = "sqs-senzing-development-exports"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-west-1"
    }

  # module.system.module.s3.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "sqs-senzing-development-exports"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-west-1"
      + restrict_public_buckets = true
    }

  # module.system.module.s3.aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = "sqs-senzing-development-exports"
      + id     = (known after apply)
      + region = "us-west-1"

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.system.module.s3.aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = "sqs-senzing-development-exports"
      + id     = (known after apply)
      + region = "us-west-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.system.module.sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 3600
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "sqs-senzing-development-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-west-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "application" = "sqs-senzing-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sqs-senzing"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + export_bucket = "sqs-senzing-development-exports"
  + queue_url     = (known after apply)

Warning: Deprecated attribute

  on .terraform/modules/logging/main.tf line 82, in resource "aws_kms_key" "logs":
  82:     region : data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```